<?php

?>

<div class="wprh_blk tab_1">
    <h2>Знаете ли вы что...</h2>
<ul>
    <li>Базовая версия WP-Recall абсолютно бесплатна</li>
    <li>Плагин работает с любой WordPress темой</li>
    <li>Плагин официально проверен и принят в <a href="https://wordpress.org/plugins/wp-recall/">репозиторий вордпресса</a></li>
    <li>Плагин есть на <a href="https://github.com/plechev-64/wp-recall">GitHub</a></li>
    <li>На странице <a href="https://codeseller.ru/arxiv-versij/">Архив версий</a> вы можете скачать прошлые мажорные версии</li>
    <li>Функционал плагина расширяется дополнениями. <a href="https://codeseller.ru/obshhie-svedeniya-o-dopolneniyax-wp-recall/">Общие сведения о дополнениях Wp-Recall</a></li>
    <li>В базовой версии их 8-мь (commerce, feed, groups, profile, publicpost, rating-system, rcl-chat, user-balance) и 2 шаблона (theme-grace и theme-sunshine)</li>
    <li>Дополнения базовой версии размещаются по пути <code>/wp-content/plugins/wp-recall/add-on/</code></li>
    <li>У плагина WP-Recall есть множество как бесплатных так и платных дополнений. <a href="https://codeseller.ru/prodcat/wp-recall/">Доступны в каталоге</a></li>
    <li>Все сторонние дополнения размещаются только тут <code>/wp-content/wp-recall/add-on/</code></li>
    <li>Дополнения загружаются из админки: "WP-Recall" -> "Дополнения", и они попадают именно туда (см. выше)</li>
    <li>Шаблоны личного кабинета загружаются со страницы: "WP-Recall" -> "Шаблоны"</li>
    <li>Одновременно активировать вы можете только один шаблон ЛК</li>
    <li>При первоначальной установке плагина активируется шаблон по умолчанию</li>
    <li>Все дополнения и шаблоны к плагину используют автоматическое обновление</li>
    <li>Обновления проверяются дважды в день</li>
    <li>Если вы так и не видите обновления в админке своего сайта, а на сайте codeseller.ru они есть и прошло больше суток - <a href="https://codeseller.ru/post-group/rabota-wordpress-krona-cron-prinuditelnoe-vypolnenie-kron-zadach-dlya-wp-recall/">Статья на эту тему</a> вам в помощь</li>
    <li>Для обновления дополнений и шаблонов необходимо вписать RCLKEY в админке вашего сайта: "WP-Recall" -> "Дополнения" -> "Введите RCLKEY" (<a href="https://codeseller.ru/avtomaticheskie-obnovleniya-dopolnenij-plagina-wp-recall/">про обновление и реколлкей</a>)</li>
    <li>RCLKEY вы можете получить в настройках своего профиля (вкладка профиль, самый низ) на сайте https://codeseller.ru</li>
    <li>Подробнее про <a href="https://codeseller.ru/privyazka-rclkey-k-ispolzuemomu-domenu/">RCLKEY</a></li>
    <li>На странице дополнений, если у вас их более 20-ти, появляется постраничная навигация</li>
    <li>Задать вывод дополнений, на одну страницу, можно справа вверху "Настройки экрана" - "Постраничная навигация" - установите свое значение</li>
    <li>В админке, на странице "Репозиторий" выводятся последние обновленные товары с постраничной навигацией</li>
    <li>У плагина WP-Recall есть система шаблонов размещенная в дополнениях в папке templates</li>
    <li>Просто скопируйте нужный шаблон по пути <code>/wp-content/wp-recall/templates/</code> - изменяйте его под себя - и при обновлении он не затрется. <a href="https://codeseller.ru/post-group/ispolzuem-funkcional-shablonov-v-plagine-wp-recall-spisok-shablonov/">Почитать подробней - весь список шаблонов</a></li>
    <li>При активации плагина он создает базовые для работы страницы</li>
    <li>Личный кабинет вы можете вывести с помощью шорткода (по умолчанию), либо через файл author.php - вписав небольшой код. Описание <a href="https://codeseller.ru/post-group/ustanovka-plagina-wp-recall-na-sajt/">тут</a></li>
    <li>Шорткод уже вписан на странице "Personal office" - в админке в списке ваших страниц</li>
    <li>Убрать надпись из личного кабинета "Personal office" легко - найдите ее в админке в списке страниц и переименуйте или вовсе сотрите заголовок</li>
    <li>Разницы вывода личного кабинета через шорткод или файл author.php практически нет</li>
    <li>Через шорткод вы получаете ссылку на кабинет вида: <code>ваш-сайт/account/?user=1</code> (надпись "user" - в админке можно задать свою. 1 - идентификатор пользователя)</li>
    <li>Через author.php ссылка на кабинет получается вида: <code>ваш-сайт/author/masha/</code> (masha - логин пользователя с которым он регистрируется)</li>
    <li>Выбрать как вам вывести из этих 2х способов личный кабинет вы можете в основных настройках реколл (предварительно включив расширенные настройки) - опция "Порядок вывода личного кабинета"</li>
    <li>Плагин добавляет свои виджеты в виджетах сайта - просто активируйте нужные со страницы "Внешний вид" -> "Виджеты"</li>
    <li>Виджет "Панель управления" вы можете переименовать оттуда. Или вообще убрать эту надпись</li>
    <li>Плагин использует свои шорткоды</li>
    <li>Все шорткоды доступны на странице <a href="https://codeseller.ru/shortkody-wp-recall/">шорткодов</a></li>
    <li>Из любого шорткода (WP-Recall или любого другого активного у вас плагина), вы можете сделать свою вкладку в личном кабинете - функционал "Произвольных вкладок"</li>
    <li>Зайдите в админке "WP-Recall" -> "Менеджер вкладок" - Задайте имя и в "Контент вкладки" впишите нужный вам шорткод</li>
    <li>В "Произвольных вкладках" вы можете использовать произвольный HTML код</li>
    <li>Там же, вы можете использовать некоторые константы. <a href="https://codeseller.ru/post-group/wp-recall-15-7-0/">Описание</a> - просто вписав их в контент</li>
    <li>Там же, порядок вкладок личного кабинета вы можете поменять перетаскиванием, сменить иконку и заголовок</li>
    <li>Там же, вы можете выбрать как будет загружаться ваша вкладка - обычно в контентной части, или поставив галку "диалоговое окно" - в сплывающем окне</li>
    <li>В "Произвольных вкладках" вы можете выводить кнопку вкладки в трех областях кабинета - смотрите вверху табы</li>
    <li>Для профиля вы можете создать произвольные поля профиля - перейдя на страницу "WP-Recall" -> "Поля профиля". <a href="https://codeseller.ru/proizvolnye-polya-wp-recall/">Описание</a></li>
    <li>Но это уже относится к описанию дополнений - смотрите <a href="https://codeseller.ru/prodcat/wp-recall/">в каталоге</a> и читайте к ним описания</li>
    <li>А страницу "Поля профиля" создает дополнение <a href="https://codeseller.ru/products/profile-recall-upravlenie-profilem-polzovatelya-na-sajte-s-pomoshhyu-wp-recall/">Profile (Профиль пользователя)</a> - его описание</li>
    <li>Кнопки плагина WP-Recall вы легко можете вписать в дизайн своего сайта - выберите ваш цвет в общих настройках "Оформление" -> "Основной цвет"</li>
    <li>Recallbar (верхняя панель) может принимать цвет от настройки установленной выше - В основных настройках включите в секции "Recalbar" -> "Цвет" -> "Основные цвета WP-Recall"</li>
    <li>Для новичков настройки плагина WP-Recall показаны только самые необходимые. Все настройки включаются на этой странице галочкой "Расширенные настройки"</li>
    <li>Множество дополнений подключают свои стилевые файлы - чтобы их объединить в один, в основных настройках включите пункт "Минимизация стилевых файлов"</li>
    <li>Аналогично с скриптами: "Минимизация скриптов" объединит доступные для минимизации скрипты в один</li>
    <li>Для ключевых запросов плагин использует кеширование - чтобы облегчить вывод в основных настройках включите кеширование и задайте его время</li>
    <li>Отключив ненужное дополнение, перейдите в настройки WP-Recall и пересохраните настройки - его настройки, располагающиеся в общем массиве настроек сотрутся, скрипты и стили переформируются (если была установлена минификация скриптов и стилей)</li>
    <li>У плагина появилась своя система логирования (<a href="https://codeseller.ru/post-group/wp-recall-16/">с 16-й версии</a>) </li>
    <li>Включается в расширенных настройках "WP-Recall" -> "Общие Настройки" -> "Режим логирования"</li>
    <li>Просто так включать не нужно - только если скажут сделать это на форуме поддержки</li>
    <li>Все логи будут храниться в папке <code>ваш-сайт/wp-content/wp-recall/logs/</code></li>
    <li>Точно поддерживается работа с плагином входа и регистраций из соцсетей <a href="https://wordpress.org/plugins/ulogin/">uLogin</a></li>
    <li>Тема в которой собираются сторонние плагины и сервисы работающие с WP-Recall - <a href="https://codeseller.ru/post-group/wp-recall-storonnie-plaginy-i-servisy-integraciya/">тут</a></li>
    <li>Чтобы написать личное сообщение нужному пользователю - перейдите в его профиль - вкладка "Личный чат"</li>
    <li>Добавить личное сообщение в избранное можно нажав на звездочку</li>
    <li>В вашем профиле, в вкладке "Личный чат" непрочитанные сообщения выделены красным</li>
    <li>В общении через личные сообщения вы можете использовать ссылки на YouTube видео, Twitter - и они превратятся в видео и твиты (при условии что в настройках Личных сообщений включено OEMBED в сообщениях)</li>
    <li>Все сервисы OEMBED доступны <a href="https://codex.wordpress.org/Embeds">тут</a> </li>
    <li>Если вы или пользователь не прочитали сообщение - уведомление об этом придет на почту.</li>
    <li>Уведомления о непрочитанных сообщениях отправляются раз в час</li>
    <li>В настройках чата можете включить "Панель контактов", тогда на каждой странице вашего сайта будет доступны 5 последних контактов</li>
    <li>Через нее вы сможете общаться с ними (см. выше)</li>
    <li>Смайлы вы можете в личные сообщения загрузить свои - вот <a href="https://codeseller.ru/forum/problemy-i-resheniya/kak-ubrat-zadvoennye-i-zatroennye-smajly/">совет</a></li>
    <li>Группы можно вывести как шорткодом так и шаблоном вашей ВП-темы</li>
    <li>Варианты вывода групп описаны <a href="https://codeseller.ru/post-group/poryadok-dobavleniya-funkcionala-grupp-s-pomoshhyu-plagina-wp-recall/">здесь</a></li>
    <li>Если после активации и настройки дополнения групп (через файл) вы получаете 404 страницу - обновите постоянные ссылки вашего сайта (просто пересохраните их)</li>
    <li>Разницы вывода групп шорткодом или через файл практически нет, отличается только урл</li>
    <li>Шорткодом вы получаете ссылку: <code>/groups/?group-id=ID</code> - где ID - идентификатор группы</li>
    <li>А вывев группы файлом, урл будет содержать слаг: <code>/groups/group-name/</code></li>
    <li>Если после активации плагина, в админке нет блока настроек wp-recall - <a href="https://codeseller.ru/forum/problemy-i-resheniya/esli-posle-aktivacii-plagina-v-adminke-net-bloka-nastroek-wp-recall/">решение</a></li>
    <li>Обновляя плагин WP-Recall на мажорные версии (первая цифра) необходимо предварительно деактивировать сторонние дополнения</li>
    <li>Перед обновлениями любых плагинов - не забывайте сделать резервную копию</li>
    <li>После обновления плагина WP-Recall и активации нужных дополнений - не повредит пересохранить настройки - просто нажмите кнопку "Сохранить настройки"</li>
    <li>Если до обновления у вас были включены опции объединения скриптов и стилей - после обновления отключите эту опцию. Сохраните настройки (чтобы стереть объединенные скрипты и стили из прошлой версии)</li>
    <li>ВНИМАНИЕ! Удалив плагин из списка плагинов в вашей админке - он удалит свои настройки и все свои данные и файлы - будьте внимательны! Делайте резервные копии</li>
    <li>Оценку к плагину, как спасибо разработчику, вы можете поставить <a href="https://wordpress.org/support/view/plugin-reviews/wp-recall?filter=5">тут</a></li>
    <li>Плагин WP-Recall переведен на Английский, Русский, Украинский и Иврит</li>
    <li>Помочь с переводом на свой язык вы можете ознакомившись со <a href="https://codeseller.ru/post-group/how-to-translate-wp-recall/">статьёй</a></li>
    <li>FAQ сайта расположен <a href="https://codeseller.ru/faq/">здесь</a></li>
    <li>Множество полезной информации коллекционируется в различных <a href="https://codeseller.ru/gruppy/">группах</a></li>
    <li>У плагина действует <a href="https://codeseller.ru/forum/">форум поддержки</a></li>
    <li>Создав свою тему на форуме поддержки - вы будете получать уведомления о ответах на почту (в чужой теме такого не будет)</li>
    <li>У каждого товара (дополнения) есть отдельная ветка форума. Нужно писать там. Это позволит в будущем создать базу знаний по отдельному товару.</li>
    <li>На форум поддержки товара можно выйти через его страницу описания. Или из общего форума.</li>
    <li>На сайте CodeSeller, в вашем фиде, вы сможете также <a href="https://codeseller.ru/user-feed/?feed-filter=simple_forum">видеть ответы</a> на ваши вопросы и темы на форуме</li>
</ul>

</div>