<?php

?>

<div class="wprh_blk tab_4">
    <h2>Сервис CodeSeller.ru</h2>
    Секреты, советы, рекомендации. Всё об этом сайте.
<ul>
    <li>Справа вверху сайта - Кнопка FEED (фид). Персональная новостная лента. Будут выводиться новости и комментарии от тех, на кого вы подписались (в личном кабинете стороннего пользователя кнопка "Подписаться" под именем), а также от тех, на кого подписались ваши друзья (двухуровневая лента)</li>
    <li>В фиде вы также можете увидеть ответы на ваши комментарии (при условии что комментатор нажал кнопку "ответить" при комментировании)</li>
    <li>Найти все свои созданные темы на форуме вы можете в своём FEED - персональная новостная лента. Вкладка <a href="https://codeseller.ru/user-feed/?feed-filter=simple_forum">"Ответы на форуме"</a></li>
    <li>Свой комментарий вы сможете отредактировать в течении 2-х минут как вы его опубликовали.</li>
    <li>Если при комментировании нажать на "Ответить" - тому пользователю придет письмо на почту</li>
    <li>Уведомление о новом комментарии придет также и автору публикации (товара)</li>
    <li>Поиск из верхнего меню ищет по сайту, но не по форуму</li>
    <li>Для поиска по форуму вам нужно перейти на <a href="https://codeseller.ru/forum/">форум</a> - слева вверху его поиск</li>
    <li>У каждого товара есть свой форум поддержки</li>
    <li>Перейти на форум поддержки товара - можно как из общего форума, так и со страницы товара (в самом низу описания "Форум поддержки товара")</li>
    <li>Создав тему на форуме поддержки товара - автору (продавцу), придет на почту уведомление о новой теме по его товару. А вы сможете видеть все свои созданные темы в вашем фиде (FEED)</li>
    <li>Если вы не выбрали тему форума и опубликовали проблему о товаре - абы где... Никто не узнает о вашей проблеме. Автору товара (продавцу) естественно не будет никакого уведомления</li>
    <li>Когда он вам ответит - вам придет уведомление на почту (при условии что вы создали эту тему)</li>
    <li>Если вы влезли в чужую тему со своим вопросом и проблемой - вам на почту не придет ответ. Ответ придет топикстартеру (тот кто создал эту тему) - поэтому лучше создавайте новую тему - мониторить ответы проще и удобней.</li>
    <li>В новой теме опишите свою проблему, если похожая проблема обсуждалась - укажите ссылкой на ту тему.</li>
    <li>Но при создании новой темы - если у вас проблема с WP-Recall плагином и его дополнениями - рекомендуется следовать <a href="https://codeseller.ru/forum/problemy-i-resheniya/vazhno-prochest-pered-publikaciej-na-forume/">этим советам</a> - практика показала, что в большинстве случаев, эти рекомендации помогают. Поэтому и была написано это руководство</li>
    <li>На странице товара статистика обновляется раз в час, кроме активных установок - она обновляется раз в сутки</li>
    <li>Пополнить личный счет вы можете после авторизации вверху сайта в меню наведя на баланс, или <a href="https://codeseller.ru/popolnenie-lichnogo-scheta/">по прямой ссылке</a></li>
    <li>Сделать запрос на вывод средств наведя на баланс в верхнем меню или в личном кабинете вкладка "Баланс"</li>
    <li><a href="https://codeseller.ru/vip-account/">Купив VIP аккаунт</a> вы сможете бесплатно скачивать и обновлять товары закрытые этим доступом. В течении времени на которое вы оформите этот аккаунт</li>
    <li>Ссылки на товар и ключи активации приходят после оплаты заказа на вашу почту, которую вы указали при регистрации</li>
    <li>Ссылки на товары доступны также из вашего личного кабинета. Под именем кнопка "Ссылки на товары"</li>
    <li>Вордпресс плагины, вордпресс шаблоны и дочерние темы купленные на CodeSeller.ru вы можете обновлять бесплатно установив плагин <a href="https://codeseller.ru/products/codeseller-updater/">Codeseller Updater</a></li>
    <li>Если у вас есть свой сайт - вы можете расположить рекламные блоки от CodeSeller - Пользователь перешедший по ним и зарегистрировавшийся на CodeSeller.ru станет вашим рефералом. Участвуйте в партнерской программе. <a href="https://codeseller.ru/reklamiruj-codeseller-ru-stanovis-partnerom/">Описание тут</a>. Закрепленные рефералы отобразятся в вашем ЛК - вкладка "Ты партнер"</li>
    <li>Если вы продавец на CodeSeller - вы можете принять участие в рекламной кампании - в ЛК вкладка "Реклама"</li>
    <li>Если вы продавец на CodeSeller - вы можете размещать свои товары на вашем сайте с актуальной статистикой. Установите дополнение <a href="https://codeseller.ru/products/seller-on-codeseller/">"Seller on CodeSeller"</a></li>
    <li>Если вы продавец на CodeSeller - вступите в закрытую группу для продавцов <a href="https://codeseller.ru/groups/klub-prodavcov/">"Клуб продавцов CODESELLER"</a></li>
    <li>Если вы продавец на CodeSeller - вы можете оформить вкладки у своего товара используя <a href="https://codeseller.ru/razmetka-readme-fajla-dlya-tovara/">markdown-разметку</a></li>
    <li>На сервисе CodeSeller работает <a href="https://codeseller.ru/task/">фриланс биржа</a> - если у вас есть задание - <a href="https://codeseller.ru/publikaciya-zadaniya/">разместите его</a>, опишите в тех.задании. Кто свободен и заинтересуется - откликнется на него</li>
    <li>Подписаться на новости сайта вы можете справа на главной "Будь в курсе новостей" или из личного кабинета - вкладка "Рассылка E-mail"</li>
</ul>

</div>